blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
#+AUTHOR: David Briggs
#+TITLE: Implementing a Copyless Redis Protocol in Rust with Parsing Combinators
#+OPTIONS: html-style:nil num:nil
<2020-02-01 Sat>
#+ATTR_HTML: target="_blank"

* Implementing a Copyless Redis Protocol in Rust with Parsing Combinators
  
[[https://redis.io/][Redis]] is a fantastic noSQL database with a beautifully simple design. 
One of the fundamental responsibilities of the redis server is to encode
and decode RESP (Redis Serialization Protocol) messages. For example, when a client issues the command:

#+begin_example
SET foo bar
#+end_example

That's encoded by the client and sent to the server as:

#+begin_example
*3\r\n$3\r\nSET\r\n$3\r\nfoo$3\r\nbar\r\n
#+end_example

It's not necessary important to understand that RESP message right now,
but the server will need to decode that back into something equivalent
so it can perform the operation. This blog post will go through
my efforts to implement a copyless RESP parser in [[https://github.com/dpbriggs/redis-oxide][redis-oxide.]]

** Redis Serialization Protocol (RESP)
   
The redis folks were kind enough to simply document the v3 protocol [[https://redis.io/topics/protocol][on their website]].
The protocol is CLRF (=\r\n=) delimited, with each word carrying a type.
The simplest types are Simple Strings and Errors, which look like:

#+begin_example
+OK\r\n
-Error Msg\r\n
#+end_example

There's also bulkstrings, which are strings with a length:

#+begin_example
$3\r\nFOO\r\n
#+end_example

We also have integers:

#+begin_example
:1337\r\n
#+end_example

And finally we have arrays, which simply have a size indicating how many redis values follow.

#+begin_example
*3\r\n$3\r\nSET\r\n$3\r\nfoo$3\r\nbar\r\n
#+end_example

We can read the array resp as:

#+begin_example
*3\r\n        -- We have three elements in this array
$3\r\nSET\r\n -- First element is a bulk string of length 3 with value SET
$3\r\nfoo     -- Second element is also a bulk string of length 3 with value foo
$3\r\nbar\r\n -- Third element is also a bulk string of length 3 with value foo
#+end_example

Now that we're familiar with the protocol, lets get an idea on what parsing combinators actually are.

** Parsing Combinators

The basic idea behind parsing combinators is that you build more complex parsers from simpler parsers.
A simple parser could do something like fetch a word, and then we can use that later to parse sentences, as they're composed of words.

From the RESP examples above, we can see that it's a series of words delimited by CLRF, so it would be /very/ handy to have a word parser.
We can implement one pretty simply by collecting all bytes until we hit a CLRF.
As we'll see later, almost everything in RESP will be parsed by varying the output of our word parser.

All parsing combinators need a way of representing position in the input. The strategy I'll be using is to have a cursor which I'll track the position of (starting at 0).

** Copyless

Now that we understand RESP, and have an idea on what a parser combinator is, we'll need to understand how we can avoid copying in redis oxide.
For context, I previously heap allocated almost all bytes in =redis-oxide=. Without digging too deep into the details, my fundamental types were defined as:

#+begin_src rust
/// These types are used by state and ops to actually perform useful work.
pub type Value = Vec<u8>;
/// Key is the standard type to index our structures
pub type Key = Vec<u8>;
#+end_src

Which meant my parser needed to output =Vec='s, which are heap allocated. =Value= and =Key= are used almost everywhere in the application
to represent almost all values in a redis command. So we need to change these types to be small, stack allocated items.
No matter what direction we take, we need to play nice with =tokio='s codec scheme.

Now it should be understood that =tokio='s [[https://docs.rs/tokio-util/0.2.0/tokio_util/codec/trait.Decoder.html][Decoder]] trait works as follows:

1. =redis-oxide= uses the =tokio= framework which provides services to listen on sockets.
2. One of the APIs provided is the =Decoder= trait, which you use to carefully read bytes off a socket to produce a type.
3. Tokio maintains a large buffer and will copy bytes received off a socket into this buffer.
4. It will pass this buffer to the parser until the parser signals that a type can be produced.
5. The =tokio= managed buffer is *smart*, and allows for several byte slices to be made safely (=Bytes= type).
6. The parser will cleave off enough bytes from the buffer when producing a type to allow =tokio= to safely copy later received bytes.
7. We bypass lifetime issues as the =Bytes= type maintains reference counts, so we can pass slices up further up the application.
8. Once =redis-oxide= is done with the produced types, we'll drop the slice references, and memory can be reclaimed.

So our parser will need to dance this careful dance. As described above, we can safely share byte slices of this underlying buffer
using the =Bytes= type. So we'll redefine our fundamental types in terms of =Bytes=:

#+begin_src rust
/// These types are used by state and ops to actually perform useful work.
pub type Value = Bytes;
/// Key is the standard type to index our structures
pub type Key = Bytes;
#+end_src

Aside from a massive related refactoring job, we now need to just write the parser 😛.

** Writing the Parser
   
Writing the parser will require us to solve a few problems:

1. Data representation and type transformations.
2. Error handling and type setup.
3. Writing the fundamental parsers.
4. Dealing with arrays.

