blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-17 Sun 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implementing a Copyless Redis Protocol in Rust with Parsing Combinators</title>
<meta name="author" content="David Briggs" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Implementing a Copyless Redis Protocol in Rust with Parsing Combinators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5481a65">Implementing a Copyless Redis Protocol in Rust with Parsing Combinators</a>
<ul>
<li><a href="#org8388eda">Redis Serialization Protocol (RESP)</a></li>
<li><a href="#org23e5363">Parsing Combinators</a></li>
<li><a href="#orga53b2ab">Copyless</a></li>
<li><a href="#orgdc2482a">Writing the Parser</a>
<ul>
<li><a href="#orgf9b2fb4">Data Representation and Type Transformations</a></li>
<li><a href="#org646e049">Error handling and Types</a></li>
</ul>
</li>
<li><a href="#orgda0628f">Writing the Fundamental Parser</a></li>
<li><a href="#org448991f">Parsing Ints</a></li>
<li><a href="#orgd16a770">Bulk Strings</a></li>
<li><a href="#org3402c42">Arrays: An Issue</a></li>
<li><a href="#org5dd1e99">Mutual Recursion: Top Level Parse Function and Arrays</a></li>
<li><a href="#org00174d6">Putting everything together</a></li>
<li><a href="#org569087d">Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-02-01 Sat&gt;</span></span>
</p>

<div id="outline-container-org5481a65" class="outline-2">
<h2 id="org5481a65">Implementing a Copyless Redis Protocol in Rust with Parsing Combinators</h2>
<div class="outline-text-2" id="text-org5481a65">
<p>
<a href="https://redis.io/">Redis</a> is a fantastic noSQL database with a beautifully simple design.
One of the fundamental responsibilities of the redis server is to encode
and decode RESP (Redis Serialization Protocol) messages. For example, when a client issues the command:
</p>

<pre class="example" id="org4007a1e">
SET foo bar
</pre>

<p>
That's encoded by the client and sent to the server as:
</p>

<pre class="example" id="org34038b8">
*3\r\n$3\r\nSET\r\n$3\r\nfoo$3\r\nbar\r\n
</pre>

<p>
It's not necessary important to understand that RESP message right now,
but the server will need to decode that back into something equivalent
so it can perform the operation. This blog post will go through
my efforts to implement a copyless RESP parser in <a href="https://github.com/dpbriggs/redis-oxide">redis-oxide.</a>
</p>
</div>

<div id="outline-container-org8388eda" class="outline-3">
<h3 id="org8388eda">Redis Serialization Protocol (RESP)</h3>
<div class="outline-text-3" id="text-org8388eda">
<p>
The redis folks were kind enough to simply document the v3 protocol <a href="https://redis.io/topics/protocol">on their website</a>.
The protocol is CLRF (<code>\r\n</code>) delimited, with each word carrying a type.
The simplest types are Simple Strings and Errors, which look like:
</p>

<pre class="example" id="org4c41e11">
+OK\r\n
-Error Msg\r\n
</pre>

<p>
There's also bulkstrings, which are strings with a length:
</p>

<pre class="example" id="org7ed6701">
$3\r\nFOO\r\n
</pre>

<p>
We also have integers:
</p>

<pre class="example" id="org69efbb9">
:1337\r\n
</pre>

<p>
And finally we have arrays, which simply have a size indicating how many redis values follow.
</p>

<pre class="example" id="org00aa5c7">
*3\r\n$3\r\nSET\r\n$3\r\nfoo$3\r\nbar\r\n
</pre>

<p>
We can read the array resp as:
</p>

<pre class="example" id="org211a044">
*3\r\n        -- We have three elements in this array
$3\r\nSET\r\n -- First element is a bulk string of length 3 with value SET
$3\r\nfoo     -- Second element is also a bulk string of length 3 with value foo
$3\r\nbar\r\n -- Third element is also a bulk string of length 3 with value foo
</pre>

<p>
Now that we're familiar with the protocol, lets get an idea on what parsing combinators actually are.
</p>
</div>
</div>

<div id="outline-container-org23e5363" class="outline-3">
<h3 id="org23e5363">Parsing Combinators</h3>
<div class="outline-text-3" id="text-org23e5363">
<p>
The basic idea behind parsing combinators is that you build more complex parsers from simpler parsers.
A simple parser could do something like fetch a word, and then we can use that later to parse sentences, as they're composed of words.
</p>

<p>
From the RESP examples above, we can see that it's a series of words delimited by CLRF, so it would be <i>very</i> handy to have a word parser.
We can implement one pretty simply by collecting all bytes until we hit a CLRF.
As we'll see later, almost everything in RESP will be parsed by varying the output of our word parser.
</p>

<p>
All parsing combinators need a way of representing position in the input. The strategy I'll be using is to have a cursor which I'll track the position of (starting at 0).
</p>
</div>
</div>

<div id="outline-container-orga53b2ab" class="outline-3">
<h3 id="orga53b2ab">Copyless</h3>
<div class="outline-text-3" id="text-orga53b2ab">
<p>
Now that we understand RESP, and have an idea on what a parser combinator is, we'll need to understand how we can avoid copying in redis oxide.
For context, I previously heap allocated almost all bytes in <code>redis-oxide</code>. Without digging too deep into the details, my fundamental types were defined as:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// These types are used by state and ops to actually perform useful work.</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Value</span> = <span style="color: #89C5C8;">Vec</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">u8</span><span style="color: #DCDCCC;">&gt;</span>;
<span style="color: #ACD2AC;">/// Key is the standard type to index our structures</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Key</span> = <span style="color: #89C5C8;">Vec</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">u8</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
Which meant my parser needed to output <code>Vec</code>'s, which are heap allocated. <code>Value</code> and <code>Key</code> are used almost everywhere in the application
to represent almost all values in a redis command. So we need to change these types to be small, stack allocated items.
No matter what direction we take, we need to play nice with <code>tokio</code>'s codec scheme.
</p>

<p>
Now it should be understood that <code>tokio</code>'s <a href="https://docs.rs/tokio-util/0.2.0/tokio_util/codec/trait.Decoder.html">Decoder</a> trait works as follows:
</p>

<ol class="org-ol">
<li><code>redis-oxide</code> uses the <code>tokio</code> framework which provides services to listen on sockets.</li>
<li>One of the APIs provided is the <code>Decoder</code> trait, which you use to carefully read bytes off a socket to produce a type.</li>
<li>Tokio maintains a large buffer and will copy bytes received off a socket into this buffer.</li>
<li>It will pass this buffer to the parser until the parser signals that a type can be produced.</li>
<li>The <code>tokio</code> managed buffer is <b>smart</b>, and allows for several byte slices to be made safely (<code>Bytes</code> type).</li>
<li>The parser will cleave off enough bytes from the buffer when producing a type to allow <code>tokio</code> to safely copy later received bytes.</li>
<li>We bypass lifetime issues as the <code>Bytes</code> type maintains reference counts, so we can pass slices up further up the application.</li>
<li>Once <code>redis-oxide</code> is done with the produced types, we'll drop the slice references, and memory can be reclaimed.</li>
</ol>

<p>
So our parser will need to dance this careful dance. As described above, we can safely share byte slices of this underlying buffer
using the <code>Bytes</code> type. So we'll redefine our fundamental types in terms of <code>Bytes</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// These types are used by state and ops to actually perform useful work.</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Value</span> = <span style="color: #89C5C8;">Bytes</span>;
<span style="color: #ACD2AC;">/// Key is the standard type to index our structures</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Key</span> = <span style="color: #89C5C8;">Bytes</span>;
</pre>
</div>

<p>
Aside from a massive related refactoring job, we now need to just write the parser 😛.
</p>
</div>
</div>

<div id="outline-container-orgdc2482a" class="outline-3">
<h3 id="orgdc2482a">Writing the Parser</h3>
<div class="outline-text-3" id="text-orgdc2482a">
<p>
Writing the parser will require us to solve a few problems:
</p>

<ol class="org-ol">
<li>Data representation and type transformations.</li>
<li>Error handling and type setup.</li>
<li>Writing the fundamental parsers.</li>
<li>Dealing with arrays.</li>
</ol>
</div>
