blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
*** Data Representation and Type Transformations
    
To better understand our requirements, let us first consider our /output/ type:

#+begin_src rust
/// RedisValueRef is the canonical type for values flowing
/// through the system. Inputs are converted into RedisValues,
/// and outputs are converted into RedisValues.
#[derive(PartialEq, Clone)]
pub enum RedisValueRef {
    String(Bytes),
    Error(Bytes),
    Int(i64),
    Array(Vec<RedisValueRef>),
    NullArray,
    NullBulkString,
    ErrorMsg(Vec<u8>), // This is not a RESP type. This is an redis-oxide internal error type.
}
#+end_src

This is the type that =redix-oxide= uses to later run commands, so our parser will eventually need to output this type.
This means we'll need to transform the given RESP buffer into one of those enums above.
Doing it directly however is expensive -- recall that the =Bytes= type needs to fiddle with reference counts.
So we'll use a simpler type:

#+begin_src rust
/// Fundamental struct for viewing byte slices
///
/// Used for zero-copy redis values.
struct BufSplit(usize, usize);

/// BufSplit based equivalent to our output type RedisValueRef
enum RedisBufSplit {
    String(BufSplit),
    Error(BufSplit),
    Int(i64),
    Array(Vec<RedisBufSplit>),
    NullArray,
    NullBulkString,
}
#+end_src

So as we're parsing, we'll need to need to track the /start/ and /end/ of a given byte slice that represents one of =RedisBufSplit=.
Later we'll use =BufSplit= and the true tokio buffer to transform =RedisBufSplit → RedisValueRef=.

So for example, if I have the following RESP fragment:

#+begin_example
frag:  $3\r\nFOO\r\n
index: 012 3 4567 8
(\r,\n are single characters)
#+end_example

We'd have the following type:

#+begin_src rust
RedisBufSplit::String(BufSplit(4,7))
#+end_src

Representing the string byte slice "FOO".

Now that we can represent our values, we'll need to consider error handling.

*** Error handling and Types
    
There's a lot of ways that parsing can fail. A client could send us straight garbage, or something more subtle like an off-by-one error.
We'll list each error in an enum type:

#+begin_src rust
#[derive(Debug)]
pub enum RESPError {
    UnexpectedEnd,
    UnknownStartingByte,
    IOError(std::io::Error),
    IntParseFailure,
    BadBulkStringSize(i64),
    BadArraySize(i64),
}
#+end_src

As we're writing rust, it's natural to use the =Result<T, E>= type.
Our success type needs to track our current position as well as returning a sensible type.
As well, we'll need to signal our parsing status to =tokio=. The =Decoder= trait has the following signature:

#+begin_src rust
fn decode(&mut self, src: &mut BytesMut) -> Result<Option<Self::Item>, Self::Error>;
#+end_src

This is a peculiar type, so let's work through the possible cases:

#+ATTR_HTML: :border 2 :rules all :frame border :padding-bottom 10px
|------------------------+------------------------------------------------------------------|
| Case                   | Meaning                                                          |
|------------------------+------------------------------------------------------------------|
| =Ok(Some(Self::Item))= | We successfully parsed a value!                             |
| =Ok(None)=             | Looks fine but incomplete. We need the client to send more data. |
| =Err(Self::Error)=     | Parsing failed somehow.                                          |
|------------------------+------------------------------------------------------------------|

So now we have all the information required. Our =Item= type needs to track position and
the actual type, so we can use a tuple =(usize, RedisBufSplit)=. Our fundamental parsing type is then:

#+begin_src rust
type RedisResult = Result<Option<(usize, RedisBufSplit)>, RESPError>;
#+end_src

All subsequent parsers will eventually need to output =RedisResult=.

