blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-orgf9b2fb4" class="outline-4">
<h4 id="orgf9b2fb4">Data Representation and Type Transformations</h4>
<div class="outline-text-4" id="text-orgf9b2fb4">
<p>
To better understand our requirements, let us first consider our <i>output</i> type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// RedisValueRef is the canonical type for values flowing</span>
<span style="color: #ACD2AC;">/// through the system. Inputs are converted into RedisValues,</span>
<span style="color: #ACD2AC;">/// and outputs are converted into RedisValues.</span>
<span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">PartialEq, Clone</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">RedisValueRef</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Bytes</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Error</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Bytes</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Int</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">i64</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Array</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vec</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">RedisValueRef</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">NullArray</span>,
    <span style="color: #89C5C8;">NullBulkString</span>,
    <span style="color: #89C5C8;">ErrorMsg</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vec</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">u8</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span>, <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">This is not a RESP type. This is an redis-oxide internal error type.</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
This is the type that <code>redix-oxide</code> uses to later run commands, so our parser will eventually need to output this type.
This means we'll need to transform the given RESP buffer into one of those enums above.
Doing it directly however is expensive &#x2013; recall that the <code>Bytes</code> type needs to fiddle with reference counts.
So we'll use a simpler type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// Fundamental struct for viewing byte slices</span>
<span style="color: #ACD2AC;">///</span>
<span style="color: #ACD2AC;">/// Used for zero-copy redis values.</span>
<span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">BufSplit</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span>;

<span style="color: #ACD2AC;">/// BufSplit based equivalent to our output type RedisValueRef</span>
<span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">RedisBufSplit</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">String</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">BufSplit</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Error</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">BufSplit</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Int</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">i64</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">Array</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Vec</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">RedisBufSplit</span><span style="color: #DDCC9C;">&gt;</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">NullArray</span>,
    <span style="color: #89C5C8;">NullBulkString</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So as we're parsing, we'll need to need to track the <i>start</i> and <i>end</i> of a given byte slice that represents one of <code>RedisBufSplit</code>.
Later we'll use <code>BufSplit</code> and the true tokio buffer to transform <code>RedisBufSplit → RedisValueRef</code>.
</p>

<p>
So for example, if I have the following RESP fragment:
</p>

<pre class="example" id="org367f1f2">
frag:  $3\r\nFOO\r\n
index: 012 3 4567 8
(\r,\n are single characters)
</pre>

<p>
We'd have the following type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">BufSplit</span><span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span>,<span style="color: #CCF8CC;">7</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Representing the string byte slice "FOO".
</p>

<p>
Now that we can represent our values, we'll need to consider error handling.
</p>
</div>
</div>

<div id="outline-container-org646e049" class="outline-4">
<h4 id="org646e049">Error handling and Types</h4>
<div class="outline-text-4" id="text-org646e049">
<p>
There's a lot of ways that parsing can fail. A client could send us straight garbage, or something more subtle like an off-by-one error.
We'll list each error in an enum type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Debug</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">enum</span> <span style="color: #89C5C8;">RESPError</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">UnexpectedEnd</span>,
    <span style="color: #89C5C8;">UnknownStartingByte</span>,
    <span style="color: #89C5C8;">IOError</span><span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">io</span>::<span style="color: #89C5C8;">Error</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">IntParseFailure</span>,
    <span style="color: #89C5C8;">BadBulkStringSize</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">i64</span><span style="color: #CCF8CC;">)</span>,
    <span style="color: #89C5C8;">BadArraySize</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">i64</span><span style="color: #CCF8CC;">)</span>,
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
As we're writing rust, it's natural to use the <code>Result&lt;T, E&gt;</code> type.
Our success type needs to track our current position as well as returning a sensible type.
As well, we'll need to signal our parsing status to <code>tokio</code>. The <code>Decoder</code> trait has the following signature:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">decode</span><span style="color: #DCDCCC;">(</span><span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">src</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #89C5C8;">BytesMut</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Error</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
This is a peculiar type, so let's work through the possible cases:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" padding-bottom="10px">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Case</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Ok(Some(Self::Item))</code></td>
<td class="org-left">We successfully parsed a value!</td>
</tr>

<tr>
<td class="org-left"><code>Ok(None)</code></td>
<td class="org-left">Looks fine but incomplete. We need the client to send more data.</td>
</tr>

<tr>
<td class="org-left"><code>Err(Self::Error)</code></td>
<td class="org-left">Parsing failed somehow.</td>
</tr>
</tbody>
</table>

<p>
So now we have all the information required. Our <code>Item</code> type needs to track position and
the actual type, so we can use a tuple <code>(usize, RedisBufSplit)</code>. Our fundamental parsing type is then:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">RedisResult</span> = <span style="color: #89C5C8;">Result</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #89C5C8;">RedisBufSplit</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #89C5C8;">RESPError</span><span style="color: #DCDCCC;">&gt;</span>;
</pre>
</div>

<p>
All subsequent parsers will eventually need to output <code>RedisResult</code>.
</p>
</div>
</div>
</div>
