blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
** Writing the Fundamental Parser

Now that we understand our data representation and errors, lets write our first parser! As mentioned several times,
RESP is a _word_ based protocol. So lets write a word parser! The only thing we care about is finding the 
position (index) of the next CLRF.

As this is infallible, we don't necessary need to use the =RedisResult= type. So our function can have the following signature:

#+begin_src rust
fn word(buf: &BytesMut, pos: usize) -> Option<(usize, BufSplit)>
#+end_src

So we'll take the tokio provided buffer =buf=, and our current position =pos=,
and if we can, output =Some((next_pos, BufSplit))=. We'll use burntsushi's fantastic =memchr=
crate to accelerate searching for CLRF (=\r\n=):

#+begin_src rust
  /// Get a word from `buf` starting at `pos`
  #[inline]
  fn word(buf: &BytesMut, pos: usize) -> Option<(usize, BufSplit)> {
      // We're at the edge of `buf`, so we can't find a word.
      if buf.len() <= pos {
          return None;
      }
      // Find the position of the b'\r'
      memchr(b'\r', &buf[pos..]).and_then(|end| {
          if end + 1 < buf.len() {
              // pos + end == first index of b'\r' after `pos`
              // pos + end + 2 == ..word\r\n<HERE> -- skip to after CLRF
              Some((pos + end + 2, BufSplit(pos, pos + end)))
          } else {
              // Edge case: We received just enough bytes from the client
              // to get the \r but not the \n
              None
          }
      })
  }
#+end_src

Great! We can now efficiently grab individual words from our input buffer. Even better, simple strings and errors are simple type transformations of this:

#+begin_src rust
  fn simple_string(buf: &BytesMut, pos: usize) -> RedisResult {
      Ok(word(buf, pos).map(|(pos, word)| (pos, RedisBufSplit::String(word))))
  }

  fn error(buf: &BytesMut, pos: usize) -> RedisResult {
      Ok(word(buf, pos).map(|(pos, word)| (pos, RedisBufSplit::Error(word))))
  }
#+end_src

If that syntax isn't super familiar, both of the above are equivalent to:

#+begin_src rust
fn simple_string(buf: &BytesMut, pos: usize) -> RedisResult {
    match word(buf, pos) {
        Some((pos, word)) => Ok(Some((pos, RedisBufSplit::String(word)))),
        None => Ok(None),
    }
}
#+end_src

So all we're doing is wrapping the =BufSplit= returned by =word= in the appropriate =RedisBufSplit= type.

Nice! So our easy types are out of the way. We now need to parse ints, bulk strings, and finally arrays.

