blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-orgda0628f" class="outline-3">
<h3 id="orgda0628f">Writing the Fundamental Parser</h3>
<div class="outline-text-3" id="text-orgda0628f">
<p>
Now that we understand our data representation and errors, lets write our first parser! As mentioned several times,
RESP is a <span class="underline">word</span> based protocol. So lets write a word parser! The only thing we care about is finding the
position (index) of the next CLRF.
</p>

<p>
As this is infallible, we don't necessary need to use the <code>RedisResult</code> type. So our function can have the following signature:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">word</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #89C5C8;">BufSplit</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">&gt;</span>
</pre>
</div>

<p>
So we'll take the tokio provided buffer <code>buf</code>, and our current position <code>pos</code>,
and if we can, output <code>Some((next_pos, BufSplit))</code>. We'll use burntsushi's fantastic <code>memchr</code>
crate to accelerate searching for CLRF (<code>\r\n</code>):
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// Get a word from `buf` starting at `pos`</span>
<span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">inline</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">word</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #89C5C8;">BufSplit</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We're at the edge of `buf`, so we can't find a word.</span>
    <span style="color: #FDECBC; font-weight: bold;">if</span> buf.len<span style="color: #CCF8CC;">()</span> &lt;= pos <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">None</span>;
    <span style="color: #CCF8CC;">}</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Find the position of the b'\r'</span>
    memchr<span style="color: #CCF8CC;">(</span>b<span style="color: #D9A0A0;">'\r'</span>, <span style="color: #DCDCCC; background-color: #313131;">&amp;</span>buf<span style="color: #DDCC9C;">[</span>pos..<span style="color: #DDCC9C;">]</span><span style="color: #CCF8CC;">)</span>.and_then<span style="color: #CCF8CC;">(</span>|end| <span style="color: #DDCC9C;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">if</span> end + <span style="color: #CCF8CC;">1</span> &lt; buf.len<span style="color: #A0EDF0;">()</span> <span style="color: #A0EDF0;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">pos + end == first index of b'\r' after `pos`</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">pos + end + 2 == ..word\r\n&lt;HERE&gt; -- skip to after CLRF</span>
            <span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span><span style="color: #9CC7FB;">(</span>pos + end + <span style="color: #CCF8CC;">2</span>, <span style="color: #89C5C8;">BufSplit</span><span style="color: #EDDCAC;">(</span>pos, pos + end<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>
        <span style="color: #A0EDF0;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #A0EDF0;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Edge case: We received just enough bytes from the client</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">to get the \r but not the \n</span>
            <span style="color: #89C5C8;">None</span>
        <span style="color: #A0EDF0;">}</span>
    <span style="color: #DDCC9C;">}</span><span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Great! We can now efficiently grab individual words from our input buffer. Even better, simple strings and errors are simple type transformations of this:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">simple_string</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Ok</span><span style="color: #CCF8CC;">(</span>word<span style="color: #DDCC9C;">(</span>buf, pos<span style="color: #DDCC9C;">)</span>.map<span style="color: #DDCC9C;">(</span>|<span style="color: #A0EDF0;">(</span>pos, word<span style="color: #A0EDF0;">)</span>| <span style="color: #A0EDF0;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #ACD2AC;">(</span>word<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">error</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Ok</span><span style="color: #CCF8CC;">(</span>word<span style="color: #DDCC9C;">(</span>buf, pos<span style="color: #DDCC9C;">)</span>.map<span style="color: #DDCC9C;">(</span>|<span style="color: #A0EDF0;">(</span>pos, word<span style="color: #A0EDF0;">)</span>| <span style="color: #A0EDF0;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Error</span><span style="color: #ACD2AC;">(</span>word<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
If that syntax isn't super familiar, both of the above are equivalent to:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">simple_string</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> word<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, word<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #9CC7FB;">(</span>word<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So all we're doing is wrapping the <code>BufSplit</code> returned by <code>word</code> in the appropriate <code>RedisBufSplit</code> type.
</p>

<p>
Nice! So our easy types are out of the way. We now need to parse ints, bulk strings, and finally arrays.
</p>
</div>
</div>
