blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
** Parsing Ints
   
Ints are the first non-trivial type to parse. RESP represents signed 64 bit integers as a base 10 string,
so we'll need to:

1. Grab a word (=BufSplit=, can turn into byte slice with =BufSplit::as_slice=)
2. Convert byte slice to a str
3. Convert the str to an i64

This process can fail on steps 2 and 3. Rust requires that strings are uft-8 encoded, so converting to a str can fail. Then someone
could pass "abc" as the int, so converting to =i64= can fail. Keeping those in mind, we can now write the =int= function:

#+begin_src rust
fn int(buf: &BytesMut, pos: usize) -> Result<Option<(usize, i64)>, RESPError> {
    match word(buf, pos) {
        Some((pos, word)) => {
            // word.as_slice(buf) is the method call BufSplit::as_slice(&self, &BytesMut) to access the byte slice.
            let s = str::from_utf8(word.as_slice(buf)).map_err(|_| RESPError::IntParseFailure)?;
            // Convert the string to an i64. Note the `?` for early returns.
            let i = s.parse().map_err(|_| RESPError::IntParseFailure)?;
            Ok(Some((pos, i)))
        }
        None => Ok(None),
    }
}
#+end_src

Nice, so we can grab ints from the input. We only need a trivial function to get the desired =RedisResult= type:

#+begin_src rust
fn resp_int(buf: &BytesMut, pos: usize) -> RedisResult {
    Ok(int(buf, pos)?.map(|(pos, int)| (pos, RedisBufSplit::Int(int))))
}
#+end_src

