blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-org448991f" class="outline-3">
<h3 id="org448991f">Parsing Ints</h3>
<div class="outline-text-3" id="text-org448991f">
<p>
Ints are the first non-trivial type to parse. RESP represents signed 64 bit integers as a base 10 string,
so we'll need to:
</p>

<ol class="org-ol">
<li>Grab a word (<code>BufSplit</code>, can turn into byte slice with <code>BufSplit::as_slice</code>)</li>
<li>Convert byte slice to a str</li>
<li>Convert the str to an i64</li>
</ol>

<p>
This process can fail on steps 2 and 3. Rust requires that strings are uft-8 encoded, so converting to a str can fail. Then someone
could pass "abc" as the int, so converting to <code>i64</code> can fail. Keeping those in mind, we can now write the <code>int</code> function:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">int</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">usize</span>, <span style="color: #89C5C8;">i64</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">&gt;</span>, <span style="color: #89C5C8;">RESPError</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> word<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, word<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #DDCC9C;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">word.as_slice(buf) is the method call BufSplit::as_slice(&amp;self, &amp;BytesMut) to access the byte slice.</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">s</span> = <span style="color: #89C5C8;">str</span>::from_utf8<span style="color: #A0EDF0;">(</span>word.as_slice<span style="color: #ACD2AC;">(</span>buf<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>.map_err<span style="color: #A0EDF0;">(</span>|_| <span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">IntParseFailure</span><span style="color: #A0EDF0;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Convert the string to an i64. Note the `?` for early returns.</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">i</span> = s.parse<span style="color: #A0EDF0;">()</span>.map_err<span style="color: #A0EDF0;">(</span>|_| <span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">IntParseFailure</span><span style="color: #A0EDF0;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>;
            <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span><span style="color: #9CC7FB;">(</span>pos, i<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Nice, so we can grab ints from the input. We only need a trivial function to get the desired <code>RedisResult</code> type:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">resp_int</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #89C5C8;">Ok</span><span style="color: #CCF8CC;">(</span>int<span style="color: #DDCC9C;">(</span>buf, pos<span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span>.map<span style="color: #DDCC9C;">(</span>|<span style="color: #A0EDF0;">(</span>pos, int<span style="color: #A0EDF0;">)</span>| <span style="color: #A0EDF0;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Int</span><span style="color: #ACD2AC;">(</span>int<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span><span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>
</div>
</div>
