blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-orgd16a770" class="outline-3">
<h3 id="orgd16a770">Bulk Strings</h3>
<div class="outline-text-3" id="text-orgd16a770">
<p>
So bulk strings in RESP start with a length (<code>i64</code>), and then the string content (delimited by CLRF of course).
So we can use our previous <code>int</code> function, and then work through the possible cases (see second code block for comments).
</p>

<p>
Here's the code without comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">bulk_string</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> int<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, -<span style="color: #CCF8CC;">1</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullBulkString</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> <span style="color: #FDECBC; font-weight: bold;">if</span> size &gt;= <span style="color: #CCF8CC;">0</span> =&gt; <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">total_size</span> = pos + size <span style="color: #FDECBC; font-weight: bold;">as</span> <span style="color: #89C5C8;">usize</span>;
            <span style="color: #FDECBC; font-weight: bold;">if</span> buf.len<span style="color: #A0EDF0;">()</span> &lt; total_size + <span style="color: #CCF8CC;">2</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">None</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">bb</span> = <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">BufSplit</span><span style="color: #9CC7FB;">(</span>pos, total_size<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>;
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #9CC7FB;">(</span><span style="color: #EDDCAC;">(</span>total_size + <span style="color: #CCF8CC;">2</span>, bb<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>_pos, bad_size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Err</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">BadBulkStringSize</span><span style="color: #A0EDF0;">(</span>bad_size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And here's the same code with comments explaining what's going on:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">bulk_string</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">recall that the `pos` returned by `int` is the first index of the string content.</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> int<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">special case: redis defines a NullBulkString type, with length of -1.</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, -<span style="color: #CCF8CC;">1</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullBulkString</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We have a size &gt;= 0</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> <span style="color: #FDECBC; font-weight: bold;">if</span> size &gt;= <span style="color: #CCF8CC;">0</span> =&gt; <span style="color: #DDCC9C;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We trust the client here, and directly calculate the end index of string (absolute w.r.t pos)</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">total_size</span> = pos + size <span style="color: #FDECBC; font-weight: bold;">as</span> <span style="color: #89C5C8;">usize</span>;
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">The client hasn't sent us enough bytes</span>
            <span style="color: #FDECBC; font-weight: bold;">if</span> buf.len<span style="color: #A0EDF0;">()</span> &lt; total_size + <span style="color: #CCF8CC;">2</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">None</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We have enough bytes, so we can generate the correct type.</span>
                <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">bb</span> = <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">BufSplit</span><span style="color: #9CC7FB;">(</span>pos, total_size<span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>;
                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">total_size + 2 == ...bulkstring\r\n&lt;HERE&gt; -- after CLRF</span>
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #9CC7FB;">(</span><span style="color: #EDDCAC;">(</span>total_size + <span style="color: #CCF8CC;">2</span>, bb<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We recieved a garbage size (size &lt; -1), so error out</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>_pos, bad_size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Err</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">BadBulkStringSize</span><span style="color: #A0EDF0;">(</span>bad_size<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Not enough bytes to parse an int (i.e. no CLRF to delimit the int)</span>
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Now we have only one type left: Arrays.
</p>
</div>
</div>

<div id="outline-container-org3402c42" class="outline-3">
<h3 id="org3402c42">Arrays: An Issue</h3>
<div class="outline-text-3" id="text-org3402c42">
<p>
Arrays are fundamentally more complex than other types as they are a <b>sequence</b> of redis values. We'll have to be more clever.
They are defined as a size (<code>i64</code>) and then a <code>size</code> number of redis values. This is naturally recursive, as we can have arrays inside arrays.
</p>

<p>
The issue is that we need a function which will parse redis values, as <code>fn array(..)</code> is only responsible for redis arrays.
But that generic parse function will also need to call the array parser!
</p>

<p>
Thankfully we can use some first year CS.
</p>
</div>
</div>
