blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-org5dd1e99" class="outline-3">
<h3 id="org5dd1e99">Mutual Recursion: Top Level Parse Function and Arrays</h3>
<div class="outline-text-3" id="text-org5dd1e99">
<p>
Lets first define our top level parse function. It's responsible for taking a buffer and returning a <code>RedisResult</code>, agnostic to particular RESP types.
RESP tags every element with a type byte, so our function is short:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">parse</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">if</span> buf.is_empty<span style="color: #CCF8CC;">()</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">match</span> buf<span style="color: #CCF8CC;">[</span>pos<span style="color: #CCF8CC;">]</span> <span style="color: #CCF8CC;">{</span>
        b<span style="color: #D9A0A0;">'+'</span> =&gt; simple_string<span style="color: #DDCC9C;">(</span>buf, pos + <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>,
        b<span style="color: #D9A0A0;">'-'</span> =&gt; error<span style="color: #DDCC9C;">(</span>buf, pos + <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>,
        b<span style="color: #D9A0A0;">'$'</span> =&gt; bulk_string<span style="color: #DDCC9C;">(</span>buf, pos + <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>,
        b<span style="color: #D9A0A0;">':'</span> =&gt; resp_int<span style="color: #DDCC9C;">(</span>buf, pos + <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>,
        b<span style="color: #D9A0A0;">'*'</span> =&gt; array<span style="color: #DDCC9C;">(</span>buf, pos + <span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>,
        _ =&gt; <span style="color: #89C5C8;">Err</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">UnknownStartingByte</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So <code>parse(..)</code> will check the byte at <code>pos</code> (initially 0), and use that to delegate to the correct function.
Now this is very useful, and will allow us to write the array parser.
</p>

<p>
Here's the code without comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">array</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> int<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, -<span style="color: #CCF8CC;">1</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullArray</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> <span style="color: #FDECBC; font-weight: bold;">if</span> num_elements &gt;= <span style="color: #CCF8CC;">0</span> =&gt; <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">values</span> = <span style="color: #89C5C8;">Vec</span>::with_capacity<span style="color: #A0EDF0;">(</span>num_elements <span style="color: #FDECBC; font-weight: bold;">as</span> <span style="color: #89C5C8;">usize</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">curr_pos</span> = pos;
            <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">_</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0</span>..num_elements <span style="color: #A0EDF0;">{</span>
                <span style="color: #FDECBC; font-weight: bold;">match</span> parse<span style="color: #ACD2AC;">(</span>buf, curr_pos<span style="color: #ACD2AC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #ACD2AC;">{</span>
                    <span style="color: #89C5C8;">Some</span><span style="color: #9CC7FB;">(</span><span style="color: #EDDCAC;">(</span>new_pos, value<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span> =&gt; <span style="color: #9CC7FB;">{</span>
                        curr_pos = new_pos;
                        values.push<span style="color: #EDDCAC;">(</span>value<span style="color: #EDDCAC;">)</span>;
                    <span style="color: #9CC7FB;">}</span>
                    <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Ok</span><span style="color: #9CC7FB;">(</span><span style="color: #89C5C8;">None</span><span style="color: #9CC7FB;">)</span>,
                <span style="color: #ACD2AC;">}</span>
            <span style="color: #A0EDF0;">}</span>
            <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span><span style="color: #9CC7FB;">(</span>curr_pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Array</span><span style="color: #EDDCAC;">(</span>values<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>_pos, bad_num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Err</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">BadArraySize</span><span style="color: #A0EDF0;">(</span>bad_num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And the same code with comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">array</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">BytesMut</span>, <span style="color: #ECBC9C;">pos</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">RedisResult</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">match</span> int<span style="color: #CCF8CC;">(</span>buf, pos<span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Not enough bytes to determine the array size</span>
        <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">None</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">special value: NullArray. Has size -1.</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, -<span style="color: #CCF8CC;">1</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullArray</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Happy path. We have a valid size (num_elements &gt; 0)</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>pos, num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> <span style="color: #FDECBC; font-weight: bold;">if</span> num_elements &gt;= <span style="color: #CCF8CC;">0</span> =&gt; <span style="color: #DDCC9C;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">As we're recieving a dynamic number of elements, we need to heap allocate our BufSplits.</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">values</span> = <span style="color: #89C5C8;">Vec</span>::with_capacity<span style="color: #A0EDF0;">(</span>num_elements <span style="color: #FDECBC; font-weight: bold;">as</span> <span style="color: #89C5C8;">usize</span><span style="color: #A0EDF0;">)</span>;
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We're going to forward iterate on `curr_pos`</span>
            <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">curr_pos</span> = pos;
            <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">_</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0</span>..num_elements <span style="color: #A0EDF0;">{</span>
                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Mutual Recursion! We need to parse the value at `curr_pos`</span>
                <span style="color: #FDECBC; font-weight: bold;">match</span> parse<span style="color: #ACD2AC;">(</span>buf, curr_pos<span style="color: #ACD2AC;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #ACD2AC;">{</span>
                    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We got a value, so add it to the `values` vector and</span>
                    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">update `curr_pos`.</span>
                    <span style="color: #89C5C8;">Some</span><span style="color: #9CC7FB;">(</span><span style="color: #EDDCAC;">(</span>new_pos, value<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span> =&gt; <span style="color: #9CC7FB;">{</span>
                        curr_pos = new_pos;
                        values.push<span style="color: #EDDCAC;">(</span>value<span style="color: #EDDCAC;">)</span>;
                    <span style="color: #9CC7FB;">}</span>
                    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Not enough bytes. Abandon parsing and free vec.</span>
                    <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Ok</span><span style="color: #9CC7FB;">(</span><span style="color: #89C5C8;">None</span><span style="color: #9CC7FB;">)</span>,
                <span style="color: #ACD2AC;">}</span>
            <span style="color: #A0EDF0;">}</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We had enough bytes to fully parse the array! Return it.</span>
            <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span><span style="color: #9CC7FB;">(</span>curr_pos, <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Array</span><span style="color: #EDDCAC;">(</span>values<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Client sent us a garbage size (num_elements &lt; -1)</span>
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span><span style="color: #A0EDF0;">(</span>_pos, bad_num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span> =&gt; <span style="color: #89C5C8;">Err</span><span style="color: #DDCC9C;">(</span><span style="color: #89C5C8;">RESPError</span>::<span style="color: #89C5C8;">BadArraySize</span><span style="color: #A0EDF0;">(</span>bad_num_elements<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>,
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So we can now parse arrays, and can now put everything together.
</p>
</div>
</div>
