blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
** Putting everything together
 

We're so close! We just need a few conversion functions before we can implement =Decoder=.
Once we're done parsing, we're guaranteed to have a contiguous
slice of memory that corresponds to the =RedisBufSplit= types we've generated until this moment. So we just need two functions:

1. Take the large =Bytes= buffer and a =BufSplit(start,end)= slice into it to make a byte slice (also =Bytes= type)
2. Take the =RedisBufSplit= and the large =Bytes= buffer and produce =RedisValueRef= types.

The conversion function is actually pretty mechanical:

#+begin_src rust
  // First, we need a convenient way to convert our index pairs into byte slices.
  impl BufSplit {
      /// Get a Bytes object representing the appropriate slice
      /// of bytes.
      ///
      /// Constant time.
      #[inline]
      fn as_bytes(&self, buf: &Bytes) -> Bytes {
          buf.slice(self.0..self.1)
      }
  }
  // Second, we'll need to convert a RedisBufSplit -> RedisValueRef given a Bytes buffer.
  impl RedisBufSplit {
      fn redis_value(self, buf: &Bytes) -> RedisValueRef {
          match self {
              // bfs is BufSplit(start, end), which has the as_bytes method defined above
              RedisBufSplit::String(bfs) => RedisValueRef::String(bfs.as_bytes(buf)),
              RedisBufSplit::Error(bfs) => RedisValueRef::Error(bfs.as_bytes(buf)),
              RedisBufSplit::Array(arr) => {
                  RedisValueRef::Array(arr.into_iter().map(|bfs| bfs.redis_value(buf)).collect())
              }
              RedisBufSplit::NullArray => RedisValueRef::NullArray,
              RedisBufSplit::NullBulkString => RedisValueRef::NullBulkString,
              RedisBufSplit::Int(i) => RedisValueRef::Int(i),
          }
      }
  }
#+end_src

We can now implement the =Decoder= trait so our parser fits in with the =tokio= machinery:

#+begin_src rust
  /// The struct we're using. We don't need to store anything in the struct.
  /// Later on we can expand this struct for optimization purposes.
  #[derive(Default)]
  pub struct RespParser;

  impl Decoder for RespParser {
      type Item = RedisValueRef;
      type Error = RESPError;
      fn decode(&mut self, buf: &mut BytesMut) -> Result<Option<Self::Item>, Self::Error> {
          if buf.is_empty() {
              return Ok(None);
          }

          match parse(buf, 0)? {
              Some((pos, value)) => {
                  // We parsed a value! Shave off the bytes so tokio can continue filling the buffer.
                  let our_data = buf.split_to(pos);
                  // Use `redis_value` defined above to get the correct type 
                  Ok(Some(value.redis_value(&our_data.freeze())))
              }
              None => Ok(None),
          }
      }
  }
#+end_src

We did it! We can now decode =RedisValueRef='s from bytes off a socket!
A complete parser includes /encoding/ RedisValueRef's, but the code is pretty simple so you can [[https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/asyncresp.rs#L190][read it here]].
You can view the [[https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/asyncresp.rs#L238][tests here]] and how it's actually used in [[https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/server.rs#L44][redis-oxide here]].

