blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-org00174d6" class="outline-3">
<h3 id="org00174d6">Putting everything together</h3>
<div class="outline-text-3" id="text-org00174d6">
<p>
We're so close! We just need a few conversion functions before we can implement <code>Decoder</code>.
Once we're done parsing, we're guaranteed to have a contiguous
slice of memory that corresponds to the <code>RedisBufSplit</code> types we've generated until this moment. So we just need two functions:
</p>

<ol class="org-ol">
<li>Take the large <code>Bytes</code> buffer and a <code>BufSplit(start,end)</code> slice into it to make a byte slice (also <code>Bytes</code> type)</li>
<li>Take the <code>RedisBufSplit</code> and the large <code>Bytes</code> buffer and produce <code>RedisValueRef</code> types.</li>
</ol>

<p>
The conversion function is actually pretty mechanical:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">First, we need a convenient way to convert our index pairs into byte slices.</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">BufSplit</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ACD2AC;">/// Get a lifetime appropriate slice of the underlying buffer.</span>
    <span style="color: #ACD2AC;">///</span>
    <span style="color: #ACD2AC;">/// Constant time.</span>
    <span style="color: #9CC7FB;">#</span><span style="color: #CCF8CC;">[</span><span style="color: #9CC7FB;">inline</span><span style="color: #CCF8CC;">]</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">as_slice</span><span style="color: #CCF8CC;">&lt;</span>'<span style="color: #ECBC9C;">a</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span>'<span style="color: #ECBC9C;">a</span> <span style="color: #89C5C8;">BytesMut</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #DCDCCC; background-color: #313131;">&amp;</span>'<span style="color: #ECBC9C;">a</span> <span style="color: #CCF8CC;">[</span><span style="color: #89C5C8;">u8</span><span style="color: #CCF8CC;">]</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; background-color: #313131;">&amp;</span>buf<span style="color: #DDCC9C;">[</span><span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">0</span>..<span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">]</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #ACD2AC;">/// Get a Bytes object representing the appropriate slice</span>
    <span style="color: #ACD2AC;">/// of bytes.</span>
    <span style="color: #ACD2AC;">///</span>
    <span style="color: #ACD2AC;">/// Constant time.</span>
    <span style="color: #9CC7FB;">#</span><span style="color: #CCF8CC;">[</span><span style="color: #9CC7FB;">inline</span><span style="color: #CCF8CC;">]</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">as_bytes</span><span style="color: #CCF8CC;">(</span><span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">Bytes</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Bytes</span> <span style="color: #CCF8CC;">{</span>
        buf.slice<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">0</span>..<span style="color: #FDECBC; font-weight: bold;">self</span>.<span style="color: #CCF8CC;">1</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Second, we'll need to convert a RedisBufSplit -&gt; RedisValueRef given a Bytes buffer.</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">RedisBufSplit</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">redis_value</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #89C5C8;">Bytes</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">RedisValueRef</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">match</span> <span style="color: #FDECBC; font-weight: bold;">self</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">bfs is BufSplit(start, end), which has the as_bytes method defined above</span>
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>bfs<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">String</span><span style="color: #A0EDF0;">(</span>bfs.as_bytes<span style="color: #ACD2AC;">(</span>buf<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>,
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Error</span><span style="color: #A0EDF0;">(</span>bfs<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">Error</span><span style="color: #A0EDF0;">(</span>bfs.as_bytes<span style="color: #ACD2AC;">(</span>buf<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span>,
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Array</span><span style="color: #A0EDF0;">(</span>arr<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #A0EDF0;">{</span>
                <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">Array</span><span style="color: #ACD2AC;">(</span>arr.into_iter<span style="color: #9CC7FB;">()</span>.map<span style="color: #9CC7FB;">(</span>|bfs| bfs.redis_value<span style="color: #EDDCAC;">(</span>buf<span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span>.collect<span style="color: #9CC7FB;">()</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span>
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullArray</span> =&gt; <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">NullArray</span>,
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">NullBulkString</span> =&gt; <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">NullBulkString</span>,
            <span style="color: #89C5C8;">RedisBufSplit</span>::<span style="color: #89C5C8;">Int</span><span style="color: #A0EDF0;">(</span>i<span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #89C5C8;">RedisValueRef</span>::<span style="color: #89C5C8;">Int</span><span style="color: #A0EDF0;">(</span>i<span style="color: #A0EDF0;">)</span>,
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We can now implement the <code>Decoder</code> trait so our parser fits in with the <code>tokio</code> machinery:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ACD2AC;">/// The struct we're using. We don't need to store anything in the struct.</span>
<span style="color: #ACD2AC;">/// Later on we can expand this struct for optimization purposes.</span>
<span style="color: #9CC7FB;">#</span><span style="color: #DCDCCC;">[</span><span style="color: #9CC7FB;">derive</span><span style="color: #CCF8CC;">(</span><span style="color: #9CC7FB;">Default</span><span style="color: #CCF8CC;">)</span><span style="color: #DCDCCC;">]</span>
<span style="color: #FDECBC; font-weight: bold;">pub</span> <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">RespParser</span>;

<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Decoder</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">RespParser</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">RedisValueRef</span>;
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Error</span> = <span style="color: #89C5C8;">RESPError</span>;
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">decode</span><span style="color: #CCF8CC;">(</span><span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">buf</span>: <span style="color: #DCDCCC; background-color: #313131;">&amp;</span><span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #89C5C8;">BytesMut</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Result</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Option</span><span style="color: #DDCC9C;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #DDCC9C;">&gt;</span>, <span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Error</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">if</span> buf.is_empty<span style="color: #DDCC9C;">()</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">None</span><span style="color: #A0EDF0;">)</span>;
        <span style="color: #DDCC9C;">}</span>

        <span style="color: #FDECBC; font-weight: bold;">match</span> parse<span style="color: #DDCC9C;">(</span>buf, <span style="color: #CCF8CC;">0</span><span style="color: #DDCC9C;">)</span><span style="color: #DCDCCC; font-weight: bold;">?</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #89C5C8;">Some</span><span style="color: #A0EDF0;">(</span><span style="color: #ACD2AC;">(</span>pos, value<span style="color: #ACD2AC;">)</span><span style="color: #A0EDF0;">)</span> =&gt; <span style="color: #A0EDF0;">{</span>
                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We parsed a value! Shave off the bytes so tokio can continue filling the buffer.</span>
                <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">our_data</span> = buf.split_to<span style="color: #ACD2AC;">(</span>pos<span style="color: #ACD2AC;">)</span>;
                <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Use `redis_value` defined above to get the correct type</span>
                <span style="color: #89C5C8;">Ok</span><span style="color: #ACD2AC;">(</span><span style="color: #89C5C8;">Some</span><span style="color: #9CC7FB;">(</span>value.redis_value<span style="color: #EDDCAC;">(</span><span style="color: #DCDCCC; background-color: #313131;">&amp;</span>our_data.freeze<span style="color: #9CBF9C;">()</span><span style="color: #EDDCAC;">)</span><span style="color: #9CC7FB;">)</span><span style="color: #ACD2AC;">)</span>
            <span style="color: #A0EDF0;">}</span>
            <span style="color: #89C5C8;">None</span> =&gt; <span style="color: #89C5C8;">Ok</span><span style="color: #A0EDF0;">(</span><span style="color: #89C5C8;">None</span><span style="color: #A0EDF0;">)</span>,
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We did it! We can now decode <code>RedisValueRef</code>'s from bytes off a socket!
A complete parser includes <i>encoding</i> RedisValueRef's, but the code is pretty simple so you can <a href="https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/asyncresp.rs#L190">read it here</a>.
You can view the <a href="https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/asyncresp.rs#L238">tests here</a> and how it's actually used in <a href="https://github.com/dpbriggs/redis-oxide/blob/535333eae64c9709614b34d4450f32f57372bb3d/src/server.rs#L44">redis-oxide here</a>.
</p>
</div>
</div>
