blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.org
** Conclusion
   
Overall this 500+ line journey has netted us an efficient, zero copy RESP parser using parsing combinators.
It was a lot of work to get the project refactored, but I am proud to have a solution I wrote myself and actually understand (no offense to the combine people). 
