blog/2020-02-01/Implementing-A-Copyless-Redis-Protocol-in-Rust-With-Parsing-Combinators.html

<div id="outline-container-org569087d" class="outline-3">
<h3 id="org569087d">Conclusion</h3>
<div class="outline-text-3" id="text-org569087d">
<p>
Overall this 500+ line journey has netted us an efficient, zero copy RESP parser using parsing combinators.
It was a lot of work to get the project refactored, but I am proud to have a solution I wrote myself and actually understand (no offense to the combine people).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2022-04-17 Sun 16:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
